# Конфигурация
config = {
    # Смещение часового пояса от UTC (по умолчанию для Москвы)
    'timezone_offset_hours': 3,
    # Месяц начала учебного года (по умолчанию сентябрь)
    'academic_year_start_month': 9,
    # День начала учебного года (по умолчанию 1 число)
    'academic_year_start_day': 1,
}

schedule = {
    'понедельник': {
        'числитель': [
            {'номер': 1, 'пара': 'Arduino', 'начало': '08:30', 'конец': '10:00'},
            {'номер': 2, 'пара': 'Data Science',
             'начало': '10:10', 'конец': '11:40'},
            {'номер': 3, 'пара': 'Документоведение',
             'начало': '12:00', 'конец': '13:30'},
            {'номер': 4, 'пара': 'Разработка курсовой',
             'начало': '13:50', 'конец': '15:20'}
        ],
        'знаменатель': [
            {'номер': 1, 'пара': 'Arduino', 'начало': '08:30', 'конец': '10:00'},
            {'номер': 2, 'пара': 'Data Science',
             'начало': '10:10', 'конец': '11:40'},
            {'номер': 3, 'пара': 'Документоведение',
             'начало': '12:00', 'конец': '13:30'},
            {'номер': 4, 'пара': 'Курсовая', 'начало': '13:50', 'конец': '15:20'}
        ]
    },
    'вторник': {
        'числитель': [
            {'номер': 2, 'пара': 'Документация для курсовой',
             'начало': '10:10', 'конец': '11:40'},
            {'номер': 3, 'пара': 'Data Analytics',
             'начало': '12:00', 'конец': '13:30'},
            {'номер': 4, 'пара': 'Маркетинг',
             'начало': '13:50', 'конец': '15:20'},
            {'номер': 5, 'пара': 'Мобилки', 'начало': '15:30', 'конец': '17:00'}
        ],
        'знаменатель': [
            {'номер': 2, 'пара': 'Менеджмент',
             'начало': '10:10', 'конец': '11:40'},
            {'номер': 3, 'пара': 'Data Analytics',
             'начало': '12:00', 'конец': '13:30'},
            {'номер': 4, 'пара': 'Маркетинг',
             'начало': '13:50', 'конец': '15:20'},
            {'номер': 5, 'пара': 'Мобилки', 'начало': '15:30', 'конец': '17:00'}
        ]
    },
    'среда': {
        'числитель': [
            {'номер': 3, 'пара': 'Документация для курсовой',
             'начало': '12:00', 'конец': '13:30'},
            {'номер': 4, 'пара': 'Разработка курсовой',
             'начало': '13:50', 'конец': '15:20'},
            {'номер': 5, 'пара': 'Мобилки', 'начало': '15:30', 'конец': '17:00'}
        ],
        'знаменатель': [
            {'номер': 3, 'пара': 'Документация для курсовой',
             'начало': '12:00', 'конец': '13:30'},
            {'номер': 4, 'пара': 'Blender', 'начало': '13:50', 'конец': '15:20'},
            {'номер': 5, 'пара': 'Мобилки', 'начало': '15:30', 'конец': '17:00'}
        ]
    },
    'четверг': {
        'числитель': [
            {'номер': 1, 'пара': 'Английский',
             'начало': '08:30', 'конец': '10:00'},
            {'номер': 2, 'пара': 'Менеджмент',
             'начало': '10:10', 'конец': '11:40'},
            {'номер': 3, 'пара': 'Blender', 'начало': '12:00', 'конец': '13:30'}
        ],
        'знаменатель': [
            {'номер': 1, 'пара': 'Английский',
             'начало': '08:30', 'конец': '10:00'},
            {'номер': 2, 'пара': 'Менеджмент',
             'начало': '10:10', 'конец': '11:40'},
            {'номер': 3, 'пара': 'Blender', 'начало': '12:00', 'конец': '13:30'}
        ]
    },
    'пятница': {
        'числитель': [
            {'номер': 2, 'пара': 'Unity', 'начало': '10:10', 'конец': '11:40'},
            {'номер': 3, 'пара': 'АСП NET', 'начало': '12:00', 'конец': '13:30'},
            {'номер': 4, 'пара': 'Физкультура',
             'начало': '13:50', 'конец': '15:20'},
            {'номер': 5, 'пара': 'Arduino', 'начало': '15:30', 'конец': '17:00'}
        ],
        'знаменатель': [
            {'номер': 2, 'пара': 'Unity', 'начало': '10:10', 'конец': '11:40'},
            {'номер': 3, 'пара': 'АСП NET', 'начало': '12:00', 'конец': '13:30'},
            {'номер': 4, 'пара': 'Физкультура',
             'начало': '13:50', 'конец': '15:20'},
            {'номер': 5, 'пара': 'Arduino', 'начало': '15:30', 'конец': '17:00'}
        ]
    },
    'суббота': {
        'числитель': [],
        'знаменатель': []
    },
    'воскресенье': {
        'числитель': [],
        'знаменатель': []
    }
}
